In [1]:
import numpy as np
import pandas as pd

In [11]:
df=pd.read_csv('train.csv',usecols=['Ticket','Cabin','Survived'])
df

     Survived            Ticket Cabin
0           0         A/5 21171   NaN
1           1          PC 17599   C85
2           1  STON/O2. 3101282   NaN
3           1            113803  C123
4           0            373450   NaN
..        ...               ...   ...
886         0            211536   NaN
887         1            112053   B42
888         0        W./C. 6607   NaN
889         1            111369  C148
890         0            370376   NaN

[891 rows x 3 columns]

In [8]:
df.dropna(inplace=True)

In [16]:
df['Cabin_num']=df['Cabin'].str.extract('(\d+)')
df['Cabin_cat']=df['Cabin'].str[0]

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\INTEL\AppData\Local\Temp\ipykernel_1652\1416112308.py:1: SyntaxWarning: invalid escape sequence '\d'
  df['Cabin_num']=df['Cabin'].str.extract('(\d+)')

In [ ]:
df.head()

   Survived            Ticket Cabin Cabin_num Cabin_cat
0         0         A/5 21171   NaN       NaN       NaN
1         1          PC 17599   C85        85         C
2         1  STON/O2. 3101282   NaN       NaN       NaN
3         1            113803  C123       123         C
4         0            373450   NaN       NaN       NaN

In [23]:
df['ticket_num']=df['Ticket'].apply(lambda s: s.split()[-1])
df['ticket_num']=pd.to_numeric(df['ticket_num'],errors='coerce',downcast='integer')


df['ticket_cat']=df['Ticket'].apply(lambda s: s.split()[0])
df['ticket_cat']=np.where(df['ticket_cat'].str.isdigit(),np.nan,df['ticket_cat'])

In [25]:
df.head(5)

   Survived            Ticket Cabin Cabin_num Cabin_cat  ticket_num ticket_cat
0         0         A/5 21171   NaN       NaN       NaN     21171.0        A/5
1         1          PC 17599   C85        85         C     17599.0         PC
2         1  STON/O2. 3101282   NaN       NaN       NaN   3101282.0   STON/O2.
3         1            113803  C123       123         C    113803.0        NaN
4         0            373450   NaN       NaN       NaN    373450.0        NaN